parts = [18, 10, 2009]

suma = sum(int(digit) for num in parts for digit in str(num))
while suma > 9:
    suma = sum(int(digit) for digit in str(suma))

print("Число:", suma)

if suma == 3:
    print("""
Представники цього типу легкі на підйом, оптимістичні і життєрадісні. 
При цьому, володіють вродженою мудрістю і проникливістю. 
Зазвичай, добре розвинена інтуїція. Такі люди - душа компанії, 
але вельми безвідповідальні в роботі. Вважають, що до життя потрібно ставитися легко.

Позитивні якості: оптимістичність, активність, готовність до взаємовиручки, 
енергійність, багатозадачність.

Негативні якості: лінь, несерйозність, відсутність навичок планування, 
непосидючість, імпульсивність, мінливість.

Відповідні професії: актор, співак, дизайнер, фотограф, художник, режисер, івент-менеджер – будь-які творчі професії.

Сумісність: ідеальні партнери – з числами долі 5 і 7, категорично не підходять "вісімки" і "трійки".
""")
